// Описание
// 
// Параметры:
// 	ПользовательИБ - СправочникСсылка.Пользователи 
// Возвращаемое значение:
// 	СправочникСсылка.Пользователи - Описание
Функция НайтиИлиСоздатьПользователя(ПользовательИБ) Экспорт

	ПользовательСсылка = НайтиПоНаименованию(ПользовательИБ.Имя);
	Если ПользовательСсылка.Пустая() Тогда
		
		ПользовательОбъект = СоздатьЭлемент();
		ПользовательОбъект.Наименование = ПользовательИБ.Имя;
		ПользовательОбъект.ПолноеИмя = ПользовательИБ.ПолноеИмя;
		ПользовательОбъект.ЗаполнитьНаборРолей(ПользовательИБ);
		ПользовательОбъект.Записать();
		
		ПользовательСсылка = ПользовательОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат ПользовательОбъект.ССылка;


КонецФункции

//@skip-warning
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	Если Истина Тогда

	Иначе
	// TODO:
КонецЕсли;


	//TODO: Вставить содержимое обработчика
КонецПроцедуры


